Repository: AlejandroOrdenes/Portfolio
Catalog: portfolioDeveloper/locale/*/LC_MESSAGES/django.po
Languages: es

source: Software Developer
es: Desarrollador de Software

source: Home
es: Inicio

source: Portfolio
es: Portafolio

source: About
es: Acerca de

source: Resume
es: Currículum

source: Contact
es: Contacto

source: Learn more about me
es: Conoce más sobre mí

source: Hello! I am a Computer Programmer with a degree from DuocUC Viña del Mar, Chile.
es: ¡Hola! Soy un Programador Computacional titulado en DuocUC Viña del Mar, Chile.

source: I specialize in software development, providing efficient technological solutions. My goal is to develop software that delivers real value to users and clients, utilizing best practices and available technologies. I am self-taught and always seeking new challenges and opportunities to expand my knowledge and skills.
es: Me especializo en el desarrollo de software, proporcionando soluciones tecnológicas eficientes. Mi objetivo es desarrollar software que ofrezca un valor real a los usuarios y clientes, utilizando las mejores prácticas y tecnologías disponibles. Soy autodidacta y siempre busco nuevos desafíos y oportunidades para ampliar mis conocimientos y habilidades.

source: In addition, my experience as a professional musician in cruise companies Princess Cruises and Cunard has enriched my communication and teamwork skills in an international environment, using English as the primary language. This combination of skills enables me to approach projects with creativity, discipline, and collaboration.
es: Además, mi experiencia como músico profesional en compañías de cruceros Princess Cruises y Cunard ha enriquecido mis habilidades de comunicación y trabajo en equipo en un entorno internacional, utilizando el inglés como idioma principal. Esta combinación de habilidades me permite abordar proyectos con creatividad, disciplina y colaboración.

source: I am excited about the opportunity to contribute as a Junior Software Developer. Please review my resume and portfolio to learn more about my projects and achievements!
es: Estoy entusiasmado con la oportunidad de contribuir como Desarrollador Junior de Software. Por favor, revisa mi currículum y portafolio para saber más sobre mis proyectos y logros.

source: Skills
es: Habilidades

source: Check My Resume
es: Revisa Mi Currículum

source: Education
es: Educación

source: Computational Programmer Analyst
es: Analista Programador Computacional

source: March 2021 - July 2023
es: Marzo 2021 - Julio 2023

source: February 2022
es: Febrero 2022

source: Languages
es: Idiomas

source: English - B1
es: Inglés - B1

source: Spanish - Native
es: Español - Nativo

source: Professional Experience
es: Experiencia Profesional

source: Multiplatform Videogame, First TRY!
es: Videojuego Multiplataforma, ¡First Try!

source: March 2024 - Present
es: Marzo 2024 - Presente

source: Multiplatform 3D skateboarding video game project. Prototyping using Unity and C#. Implementation of gameplay mechanics, animations, UI systems, and game logic. Backend develpment .NET
es: Proyecto de videojuego 3D de skateboarding multiplataforma. Prototipado usando Unity y C#. Implementación de mecánicas de juego, animaciones, sistemas de interfaz de usuario y lógica del juego. Desarrollo backend con .NET

source: Technologies used in the project:
es: Tecnologías utilizadas en el proyecto:

source: ArbStrat Crypto, Analysis and Arbitrage Simulation
es: ArbStrat Crypto, Análisis y Simulación de Arbitraje

source: March 2023 - July 2023
es: Marzo 2023 - Julio 2023

source: Development of a Web Application to find arbitrage opportunities with cryptocurrencies, taking real-time price data from the Dydx API. An API was created for data handling and processing.
es: Desarrollo de una aplicación web para encontrar oportunidades de arbitraje con criptomonedas, utilizando datos de precios en tiempo real desde la API de Dydx. Se creó una API para el manejo y procesamiento de datos.

source: Bigeo, Mobile App
es: Bigeo, Aplicación Móvil

source: September 2022 - December 2022
es: Septiembre 2022 - Diciembre 2022

source: Development of a mobile application for the control of fruit tree plantations.
es: Desarrollo de una aplicación móvil para el control de plantaciones de árboles frutales.

source: My Proyects
es: Mis Proyectos

source: StartTrend – AI-Powered News Platform with Automated Web Scraping
es: StartTrend – Plataforma de Noticias con IA y Web Scraping Automatizado

source: StartTrend is a full-stack web platform that uses artificial intelligence and automated web scraping to create and publish technology news. It collects articles from sources like TechCrunch and VentureBeat, summarizes and rewrites them using OpenAI’s API, and generates unique AI images for each post. Built with Spring Boot, Next.js, and MongoDB, and deployed on a DigitalOcean VPS with Nginx and CRON automation, it delivers a fully autonomous and scalable news system.
es: StartTrend es una plataforma web full-stack que utiliza inteligencia artificial y web scraping automatizado para crear y publicar noticias de tecnología. Recopila artículos de fuentes como TechCrunch y VentureBeat, los resume y reescribe usando la API de OpenAI, y genera imágenes únicas con IA para cada publicación. Desarrollada con Spring Boot, Next.js y MongoDB, y desplegada en un VPS de DigitalOcean con Nginx y automatización mediante CRON, ofrece un sistema de noticias totalmente autónomo y escalable.

source: Web application that seeks cryptocurrency pairs for arbitrage operations. It is based on a strategy of cointegrated pairs and calculations of different metrics to search for favorable arbitrage opportunities.
es: Aplicación web que busca pares de criptomonedas para operaciones de arbitraje. Se basa en una estrategia de pares cointegrados y en cálculos de diferentes métricas para identificar oportunidades favorables de arbitraje.

source: Prototype of a skateboarding video game, developed in Unity 3D. Project in development.
es: Prototipo de un videojuego de skateboarding desarrollado en Unity 3D. Proyecto actualmente en desarrollo.

source: Contact Me
es: Contáctame

source: Social Profiles
es: Perfiles Sociales

source: Email
es: Correo electrónico

source: English
es: Inglés

source: Spanish
es: Español
